{
    "name": "Dean Walton",
    "email": "dean0machin00@gmail.com",
    "graduation date": "January 24, 2024",
    "location":"Seattle, wA",
    "headshot": "https://i.imgur.com/hJm9WyW.jpg",
    "headshot-2": "https://i.imgur.com/M1OjTJ4.jpg",
    "headshot-3": "https://i.imgur.com/ISajSDx.jpg",
    "bio": "Dean Walton is a versatile individual who has embarked on a transformative journey into the world of software engineering, complementing his decade-long career as an Aerospace Machinist and bartender. His story is a testament to his unrelenting pursuit of new challenges and his unwavering commitment to personal growth and excellence.Dean is currently a student in General Assembly's Immersive Software Engineering Program, where he has been honing his skills and preparing to make a significant leap in his career. Scheduled to graduate on January 24, 2024, Dean is overflowing with enthusiasm about his newfound passion for software engineering. His desire to explore this exciting field stems from his deep-rooted fascination with technology and a relentless thirst for knowledge. Dean envisions a future where he leverages his diverse skill set to contribute to the dynamic world of technology. Dean's journey through the General Assembly program has been nothing short of remarkable. With unwavering dedication, he has acquired a robust set of skills that includes HTML, CSS, JavaScript, Node.js, MongoDB, Mongoose, Express.js, React, Python, and Django. He has also mastered the art of debugging code and learned how to seamlessly collaborate with development teams. As Dean looks forward to his post-graduation future, he is eager to join the workforce as a junior developer at a forward-thinking company that offers ample room for growth and potential. His ultimate aspiration is to focus on full-stack development, drawing from his newfound knowledge and skills to craft innovative solutions and contribute to the ever-evolving tech landscape. Dean Walton's journey embodies the spirit of growth and exploration. His transition from the aerospace industry to the realm of software engineering demonstrates his adaptability and determination to excel in any field he chooses. With his unique blend of technical expertise, precision engineering experience, and a background in hospitality, Dean is poised to make a lasting impact in the world of technology and beyond." 
}